# Set Up

### Import necessary packages

In [1]:
import pandas as pd

### Import data

In [2]:
relative_path = "Data/clean_us_monthly_retail_sales_1992_to_2022.csv"
df = pd.read_csv(relative_path)
df.head()

                                    Kind of Business        Date   Sales
0              Retail and food services sales, total  2022-01-01  583761
1  Retail sales and food services excl motor vehi...  2022-01-01  469700
2  Retail sales and food services excl gasoline s...  2022-01-01  536142
3  Retail sales and food services excl motor vehi...  2022-01-01  422081
4                                Retail sales, total  2022-01-01  516923

In [3]:
df.describe()

                             Kind of Business        Date  Sales
count                                   24180       24180  24180
unique                                     65         372  16731
top     Retail and food services sales, total  2022-01-01   (NA)
freq                                      372          65    492

In [4]:
df.dtypes

Kind of Business    object
Date                object
Sales               object
dtype: object

In [7]:
df["Date"] = pd.to_datetime(df["Date"])
df.dtypes

Kind of Business            object
Date                datetime64[ns]
Sales                       object
dtype: object

In [10]:
df["Sales"] = pd.to_numeric(df["Sales"],errors="coerce")
df.dtypes

Kind of Business            object
Date                datetime64[ns]
Sales                      float64
dtype: object

In [12]:
df.dropna(subset=['Sales'], inplace=True)
df.describe()

                                Date          Sales
count                          23427   23427.000000
mean   2007-07-17 18:32:59.562043648   44574.681265
min              1992-01-01 00:00:00      11.000000
25%              2000-01-16 12:00:00    2611.000000
50%              2007-08-01 00:00:00    9237.000000
75%              2015-02-01 00:00:00   36925.500000
max              2022-12-01 00:00:00  741521.000000
std                              NaN   92410.746793

# Analysis

## Trends

### Simple Trend

#### Trends on total retail and food services sales in the US

On the x-axis, we have months. On the y-axis, we have total monthly retail and food services sales in the US in millions of US dolars.

In [13]:
retail_food_service = df.loc[df["Kind of Business"]=="Retail and food services sales, total"]
retail_food_service.head()

                          Kind of Business       Date     Sales
0    Retail and food services sales, total 2022-01-01  583761.0
65   Retail and food services sales, total 2022-02-01  577319.0
130  Retail and food services sales, total 2022-03-01  679465.0
195  Retail and food services sales, total 2022-04-01  679473.0
260  Retail and food services sales, total 2022-05-01  702760.0